In [1]:
import pandas as pd

In [3]:
# series and indexing(fast indexing direction)

In [4]:
school_fee = [[50000,25000,30000],[15000,20000,25000]]

In [3]:
countries_temp = [[[42,40,38]]]

In [4]:
import pandas as pd

In [6]:
countries_temp = [[[42,40,38]]]

In [22]:
khi_temp_dict = {'10:00':35,'11:00':36,'12:00':28,'13:00':40}

In [31]:
lhrs_temp_dict = pd.Series(khi_temp_dict)

In [39]:
students = pd.DataFrame([{'name':'fayyaz','age':16},{'name':'meerab','age':16},{'name':"sadiq",'age':22}])

In [40]:
students

   age    name
0   16  fayyaz
1   16  meerab
2   22   sadiq

In [47]:
frame2 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data = pd.DataFrame(frame2)

In [48]:
data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [56]:
data.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [57]:
data.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [55]:
data.debt=

C:\Users\Zeeshan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [59]:
pop = {'Nevada': {2001:204,2002: 302},
      'Ohio':{2001:202,2002:300}}

In [60]:
frame3 = pd.DataFrame(pop)

In [61]:
frame3

      Nevada  Ohio
2001     204   202
2002     302   300